jlckfb/Candis-S31/examples/esp-idf/display-touch/sdkconfig.defaults.esp32s31
CONFIG_IDF_TARGET=esp32s31
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# QIO 80 MHz flash, validated on EVT1 (player baseline).
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Single 8 MB app partition (no OTA); see partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
